Workspace/OpenFOAM-v1812-AD/tutorials/incompressible/simpleFoam/T3A/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication $(getApplication)

( cd validation && ./createGraphs )

#------------------------------------------------------------------------------
